---

C#Visual BasicVisual C++

Revit 2024 API
---
DuctSizeSettings..::..GetEnumerator Method
DuctSizeSettings Class See Also Send Feedback
---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public virtual IEnumerator<KeyValuePair<DuctShape, DuctSizes>> GetEnumerator()

Visual Basic
---

    Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of DuctShape, DuctSizes))

Visual C++
---

    public:
    virtual IEnumerator<KeyValuePair<DuctShape, DuctSizes^>>^ GetEnumerator()

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()

# See Also

DuctSizeSettings Class

Autodesk.Revit.DB.Mechanical Namespace